'''
15 14
00000111100000
11111101111110
11011101101110
11011101100000
11011111111111
11011111111100
11000000011111
01111111111111
00000000011111
01111111111000
00011111111000
00000001111000
11111111110011
11100011111111
11100011111111
'''
# 다음과 같은 입력값이 있을 때 둘째 줄부터 숫자를 한 자리씩 나누어 리스트로 저장하는 코드
n , m = map(int, input().split())
graph = []
for i in range(n):
    row = []
    for i in map(int, input()): # map(): iterable의 모든 요소에 대해서 함수를 적용하여 iterator를 리턴함.
        row.append(i)
    graph.append(row)
print(graph)
